{
    "shows": [
        {
            "id": 169,
            "name": "Breaking Bad",
            "genres": [
                "Drama",
                "Crime",
                "Thriller"
        ],
            "rating": {
                "average": 9.2
            },
            "image": {
                "medium": "https://static.tvmaze.com/uploads/images/medium_portrait/501/1253519.jpg",
                "original": "https://static.tvmaze.com/uploads/images/original_untouched/501/1253519.jpg"
            },
            "summary": "Breaking Bad follows protagonist Walter White, a chemistry teacher who lives in New Mexico with his wife and teenage son who has cerebral palsy. White is diagnosed with Stage III cancer and given a prognosis of two years left to live. With a new sense of fearlessness based on his medical prognosis, and a desire to secure his family's financial security, White chooses to enter a dangerous world of drugs and crime and ascends to power in this world. The series explores how a fatal diagnosis such as White's releases a typical man from the daily concerns and constraints of normal society and follows his transformation from mild family man to a kingpin of the drug trade."
        },
        {
            "id": 184,
            "name": "BoJack Horseman",
            "genres": [
                "Drama",
                "Comedy"
        ],
            "rating": {
                "average": 7.9
        },
            "image": {
                "medium": "https://static.tvmaze.com/uploads/images/medium_portrait/405/1012627.jpg",
                "original": "https://static.tvmaze.com/uploads/images/original_untouched/405/1012627.jpg"
        },
            "summary": "Meet the most beloved sitcom horse of the '90s, 20 years later. He's a curmudgeon with a heart of... not quite gold... but something like gold. Copper?"
        },
        {
            "id": 5,
            "name": "True Detective",
            "genres": [
                "Drama",
                "Crime",
                "Thriller"
        ],
            "rating": {
                "average": 8.1
        },
            "image": {
                "medium": "https://static.tvmaze.com/uploads/images/medium_portrait/490/1226764.jpg",
                "original": "https://static.tvmaze.com/uploads/images/original_untouched/490/1226764.jpg"
        },
            "summary": "Touch darkness and darkness touches you back. True Detective centers on troubled cops and the investigations that drive them to the edge. Each season features a new cast and a new case.True Detective is an American anthology crime drama television series created and written by Nic Pizzolatto."
        },
        {
            "id": 40,
            "name": "Death Note",
            "genres": [
            "Anime",
            "Fantasy",
            "Thriller"
        ],
            "rating": {
                "average": 8.8
        },
            "image": {
            "medium": "https://static.tvmaze.com/uploads/images/medium_portrait/499/1249019.jpg",
            "original": "https://static.tvmaze.com/uploads/images/original_untouched/499/1249019.jpg"
        },
            "summary": "Death Note is an anime series based around a manga of the same name whereby a human finds a death god's notebook. Any person's name written in this notebook will die. The main character who finds this noteboook is Light Yagami who faces off against an unfaced character named L who tries to challenge him."
        },
        {
            "id": 107,
            "name": "Bob's Burgers",
            "genres": [
                "Comedy",
                "Family"
        ],
            "rating": {
                "average": 8
        },
        "image": {
            "medium": "https://static.tvmaze.com/uploads/images/medium_portrait/476/1192165.jpg",
            "original": "https://static.tvmaze.com/uploads/images/original_untouched/476/1192165.jpg"
        },
        "summary": "The series follows Bob who runs Bob's Burgers, with the help of his wife and their three kids. Bob has big ideas about burgers, but the rest of the clan falls short on service. Despite the greasy counters and lousy location, the Belchers are determined to make every \"Grand Re-Re-Re-opening\" a success. Bob's wife, Linda, stands by her man and often does so by bursting into song. Their eldest daughter, 13-year-old Tina has a slight obsession with boys and zombies. Middle child Gene is an aspiring musician with a thirst for life. Louise is the bunny ears-wearing youngest daughter with an off-kilter sense of humor that makes her somewhat of a liability in the kitchen – and with the public."
        }



    ]
}